# Working With Databases

In [2]:
#conda install -c anaconda sqlite

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

## Package Plan ##

  environment location: C:\ProgramData\Anaconda3

  added / updated specs:
    - sqlite


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    ca-certificates-2020.1.1   |                0         165 KB  anaconda
    certifi-2020.4.5.1         |           py37_0         159 KB  anaconda
    conda-4.8.3                |           py37_0         3.0 MB  anaconda
    openssl-1.1.1              |       he774522_0         5.7 MB  anaconda
    sqlite-3.31.1              |       he774522_0         961 KB  anaconda
    ------------------------------------------------------------
                                           Total:        10.0 MB

The following packages will be UPDATED:

  certifi              pkgs/main::certifi-2019.11.28-py37_1 --> anaconda::certifi-2020.4.5.1-py37_0
  openssl              pkgs/main::openssl-1.1.1f-he774522_0 --> anaconda::openssl-1.1.1-he774522_0

The following packages will be SUPERSEDED by a higher-priority channel:

  ca-certificates                                 pkgs/main --> anaconda
  conda                                           pkgs/main --> anaconda
  sqlite                                          pkgs/main --> anaconda



Downloading and Extracting Packages

ca-certificates-2020 | 165 KB    |            |   0%
ca-certificates-2020 | 165 KB    | 9          |  10%
ca-certificates-2020 | 165 KB    | ########## | 100%

openssl-1.1.1        | 5.7 MB    |            |   0%
openssl-1.1.1        | 5.7 MB    | 2          |   2%
openssl-1.1.1        | 5.7 MB    | 6          |   7%
openssl-1.1.1        | 5.7 MB    | #4         |  14%
openssl-1.1.1        | 5.7 MB    | #7         |  18%
openssl-1.1.1        | 5.7 MB    | ##         |  21%
openssl-1.1.1        | 5.7 MB    | ##6        |  26%
openssl-1.1.1        | 5.7 MB    | ###        |  30%
openssl-1.1.1        | 5.7 MB    | ###3       |  34%
openssl-1.1.1        | 5.7 MB    | ###6       |  37%
openssl-1.1.1        | 5.7 MB    | ###9       |  40%
openssl-1.1.1        | 5.7 MB    | ####2      |  43%
openssl-1.1.1        | 5.7 MB    | ####5      |  45%
openssl-1.1.1        | 5.7 MB    | ####7      |  48%
openssl-1.1.1        | 5.7 MB    | #####2     |  52%
openssl-1.1.1        | 5.7 MB    | #####5     |  55%
openssl-1.1.1        | 5.7 MB    | #####7     |  58%
openssl-1.1.1        | 5.7 MB    | ######     |  61%
openssl-1.1.1        | 5.7 MB    | ######3    |  64%
openssl-1.1.1        | 5.7 MB    | ######6    |  67%
openssl-1.1.1        | 5.7 MB    | ######9    |  70%
openssl-1.1.1        | 5.7 MB    | #######6   |  76%
openssl-1.1.1        | 5.7 MB    | #######9   |  80%
openssl-1.1.1        | 5.7 MB    | ########3  |  83%
openssl-1.1.1        | 5.7 MB    | ########6  |  87%
openssl-1.1.1        | 5.7 MB    | ########9  |  90%

Note: you may need to restart the kernel to use updated packages.openssl-1.1.1        | 5.7 MB    | #########3 |  93%
openssl-1.1.1        | 5.7 MB    | #########6 |  96%
openssl-1.1.1        | 5.7 MB    | #########9 | 100%
openssl-1.1.1        | 5.7 MB    | ########## | 100%

sqlite-3.31.1        | 961 KB    |            |   0%
sqlite-3.31.1        | 961 KB    | 8          |   8%
sqlite-3.31.1        | 961 KB    | ##8        |  28%
sqlite-3.31.1        | 961 KB    | ####8      |  48%
sqlite-3.31.1        | 961 KB    | ######8    |  68%
sqlite-3.31.1        | 961 KB    | ########8  |  88%
sqlite-3.31.1        | 961 KB    | ########## | 100%

certifi-2020.4.5.1   | 159 KB    |            |   0%
certifi-2020.4.5.1   | 159 KB    | ####       |  40%
certifi-2020.4.5.1   | 159 KB    | ########## | 100%

conda-4.8.3          | 3.0 MB    |            |   0%
conda-4.8.3          | 3.0 MB    | 1          |   2%
conda-4.8.3          | 3.0 MB    | 8          |   9%

EnvironmentNotWritableError: The current user does not have write permissions to the target environment.
  environment location: C:\ProgramData\Anaconda3

conda-4.8.3          | 3.0 MB    | #6         |  16%
conda-4.8.3          | 3.0 MB    | ##3        |  24%
conda-4.8.3          | 3.0 MB    | ###1       |  31%
conda-4.8.3          | 3.0 MB    | ###8       |  38%
conda-4.8.3          | 3.0 MB    | ####4      |  45%
conda-4.8.3          | 3.0 MB    | #####      |  50%
conda-4.8.3          | 3.0 MB    | ######2    |  63%
conda-4.8.3          | 3.0 MB    | ######9    |  69%
conda-4.8.3          | 3.0 MB    | #######5   |  75%
conda-4.8.3          | 3.0 MB    | ########1  |  82%
conda-4.8.3          | 3.0 MB    | ########7  |  87%
conda-4.8.3          | 3.0 MB    | #########2 |  92%
conda-4.8.3          | 3.0 MB    | #########7 |  97%
conda-4.8.3          | 3.0 MB    | ########## | 100%
Preparing transaction: ...working... done
Verifying transaction: ...working... failed

In [4]:
#conda install -c anaconda sqlite

import sqlite3

#creating table
query = """ CREATE TABLE test(a VARCHAR(20),
b VARCHAR(20), c REAL,
d INTEGER); """
con = sqlite3.connect('ryzuqp.sqlite')
con.execute(query)

In [5]:
# inserting data
data = [('Atlanta', 'Georgia', 1.25, 6),
       ('Tallahassee', 'Florida', 2.6, 3),
       ('Sacramento', 'California', 1.7, 5)
       ]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [6]:
#selecting/extracting data
cursor = con.execute('select * from test')
rows = cursor.fetchall()
print(type(rows), rows)

<class 'list'> [('Atlanta', 'Georgia', 1.25, 6), ('Tallahassee', 'Florida', 2.6, 3), ('Sacramento', 'California', 1.7, 5)]

In [7]:
import pandas as pd

print(cursor.description)
data_df = pd.DataFrame(rows, columns = [x[0] for x in cursor.description])
data_df

(('a', None, None, None, None, None, None), ('b', None, None, None, None, None, None), ('c', None, None, None, None, None, None), ('d', None, None, None, None, None, None))

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [8]:
import pandas as pd

print(cursor.description)
data_df = pd.DataFrame(rows, columns = [x[1] for x in cursor.description])
data_df

(('a', None, None, None, None, None, None), ('b', None, None, None, None, None, None), ('c', None, None, None, None, None, None), ('d', None, None, None, None, None, None))

           NaN         NaN   NaN  NaN
0      Atlanta     Georgia  1.25    6
1  Tallahassee     Florida  2.60    3
2   Sacramento  California  1.70    5

In [9]:
import pandas as pd

print(cursor.description)
data_df = pd.DataFrame(rows, columns = [x[2] for x in cursor.description])
data_df

(('a', None, None, None, None, None, None), ('b', None, None, None, None, None, None), ('c', None, None, None, None, None, None), ('d', None, None, None, None, None, None))

           NaN         NaN   NaN  NaN
0      Atlanta     Georgia  1.25    6
1  Tallahassee     Florida  2.60    3
2   Sacramento  California  1.70    5

In [10]:
data_df = pd.DataFrame(rows, columns = [x[2] for x in cursor.description])
data_df

           NaN         NaN   NaN  NaN
0      Atlanta     Georgia  1.25    6
1  Tallahassee     Florida  2.60    3
2   Sacramento  California  1.70    5

In [11]:
data_df = pd.DataFrame(rows, columns = [x[0] for x in cursor.description])
data_df

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [13]:
#conda install -c anaconda sqlalchemy
# using sqlalchemy
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from test', db)

Empty DataFrame
Columns: [a, b, c, d]
Index: []

In [14]:
db = sqla.create_engine('sqlite:///ryzuqp.sqlite')
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [15]:
db = sqla.create_engine('sqlite:///ryzuqp.sqlite')
data_df = pd.read_sql('select * from test', db)
print(data_df)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5